english/chapter7/report.tex
% Intended LaTeX compiler: pdflatex
\documentclass[dvipdfmx,10pt,presentation]{beamer}
\usepackage{amsmath, amssymb, bm}
\usepackage[utf8]{inputenc}
\usepackage{indentfirst}
\usepackage[normalem]{ulem}
\usepackage{longtable}
\usepackage{minted}
\usepackage{fancyvrb}
\usetheme{Berlin}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\useoutertheme[subsection=false]{smoothbars}
\setbeamertemplate{footline}[page number]
\setbeamercolor{page number in head/foot}{fg=black}
\setbeamerfont{page number in head/foot}{size=\normalsize}
\author{情報科学類３年 江畑 拓哉 (201611350)}
\date{}
\title{QR分解}
\begin{document}

\maketitle
\tableofcontents


\section{導入}
\label{sec:orga5147c1}
\begin{enumerate}
\item 導入
\label{sec:orgb1b1035}
　行列を直交変換を用いて三角行列や対角行列と言った形に小さく圧縮したい。\\
　\(\rightarrow\) そのような圧縮手法として ``QR分解'' が挙げられる。\\

　QR分解とはある行列 \(\bm{A}\) を直交行列と三角行列に因数分解する手法で、分解される2つの条件に \texttt{三角行列である} という点のみが要求されるという意味でLU分解よりも広い範囲をカバーする。\\
\begin{enumerate}
\item LU分解の適用条件
\label{sec:orgd84c49a}
分解する行列 \(\bm{A}\) が正則行列であること\\
\end{enumerate}
\end{enumerate}

\section{直交変換を用いた三角行列への変換}
\label{sec:orgaac233b}
\begin{enumerate}
\item 　
\label{sec:org38e4a80}


　直交変換の一つであるハウスホルダー変形を行うことで、任意の行列 \(\bm{A}\ \in \ \mathbb{R}^{m \times n}\ where\ m \geq n\) について上三角行列 \(\bm{R}\) と 直交行列 \(\bm{Q}\ \in\ \mathbb{R}^{m \times m}\) を用いた関係式を作ることが出来る。\\

\begin{align*}
\bm{A}\ \rightarrow\ \bm{Q}^T\bm{A}\ = \begin{pmatrix}R \\ 0\end{pmatrix}
&& where\ R\ \in\ \mathbb{R}^{n\times n}
\end{align*}

\item \(\bm{A}\ \in\ \mathbb{R}^{5\times4}\) である場合について考えた時
\label{sec:org8797f80}
　最初のステップでは1列目の上から1番目より下の要素をゼロにする。\\

\begin{align*}
\bm{H}_1\bm{A} = \bm{H}_1
\begin{pmatrix}
\times & \times & \times & \times \\
\times & \times & \times & \times \\
\times & \times & \times & \times \\
\times & \times & \times & \times \\
\times & \times & \times & \times \\
\end{pmatrix}
=
\begin{pmatrix}
+ & + & + & + \\
0 & + & + & + \\
0 & + & + & + \\
0 & + & + & + \\
0 & + & + & + \\
\end{pmatrix}
\end{align*}

　ここで、 \(+\) の値は \(\times\) に比べて変形されて値が変わっています。直交行列である \(\bm{H}_1\) の適用は、ハウスホルダー変換を行うことに等しい。\\

　次のステップでは変換した \(\bm{A}\) に対して、前のステップと同様に2列目の上から2番目より下の要素をゼロにして、\\

\begin{align*}
\bm{H}_2
\begin{pmatrix}
\times & \times & \times & \times \\
0 & \times & \times & \times \\
0 & \times & \times & \times \\
0 & \times & \times & \times \\
0 & \times & \times & \times \\
\end{pmatrix}
=
\begin{pmatrix}
\times & \times & \times & \times \\
0 & + & + & + \\
0 & 0 & + & + \\
0 & 0 & + & + \\
0 & 0 & + & + \\
\end{pmatrix}
\end{align*}


\framebreak\\
　三番目のステップでも同様に変換して、\\

\begin{align*}
\bm{H}_3
\begin{pmatrix}
\times & \times & \times & \times \\
0 & \times & \times & \times \\
0 & 0 & \times & \times \\
0 & 0 & \times & \times \\
0 & 0 & \times & \times \\
\end{pmatrix}
=
\begin{pmatrix}
\times & \times & \times & \times \\
0 & \times & \times & \times \\
0 & 0 & + & + \\
0 & 0 & 0 & + \\
0 & 0 & 0 & + \\
\end{pmatrix}
\end{align*}

　四番目のステップでも同様にして、上三角行列 \(\bm{R}\) を得ることが出来る。\\
　この変換を要約すると、\\

\begin{align*}
\bm{Q}^T\bm{A}=
\begin{pmatrix}
\bm{R} \\
\bm{0}
\end{pmatrix}
&& where\ \bm{Q}^T =\bm{H}_4\bm{H}_3\bm{H}_2\bm{H}_1
\end{align*}

　また、 \(\bm{H}_i\ where\ \bm{A}\ \in\ \mathbb{R}^{m\times n}\) の構造は以下のようになる。\\

\begin{align}
\bm{H}_1 &= \bm{I} - 2\bm{u}_1\bm{u}_1^T && where\ u_1\ \in\ \mathbb{R}^m \nonumber \\
\bm{H}_2 &= 
\begin{pmatrix}
1 & 0 \\
0 & \bm{P}_2
\end{pmatrix}
&& where\ \bm{P}_2=\bm{I} - 2\bm{u}_2\bm{u}_2^T,\ \bm{u}_2\ \in\ \mathbb{R}^{m-1}
\nonumber \\ 
\bm{H}_3 &= 
\begin{pmatrix}
1 & 0 & 0 \\
0 & 1 & 0 \\
0 & 0 & \bm{P}_3 
\end{pmatrix}
&& where\ \bm{P}_3=\bm{I} - 2\bm{u}_3\bm{u}_3^T,\ \bm{u}_3\ \in\ \mathbb{R}^{m-2}
\tag{5.1}
\end{align}



　このようにして、単位行列に連続して小さくなっていくハウスホルダー変換を埋め込み、それと同時にベクトル \(\bm{u}_i\) の次元も小さくなる。\\
　\\
\(\bm{H}_i\) がハウスホルダー変換でもあることは自明である。例えば\\

\begin{align*}
\bm{H_3} = \bm{I} - 2 \bm{u}^{(3)} \bm{u}^{(3)^T} 
&&  where\ \bm{u}^{(3)}=
\begin{pmatrix}
0 \\
0 \\
\bm{u}_3
\end{pmatrix}
\end{align*}

　尚、三角行列への変換は行列 \(\bm{A}\) の圧縮と等しい。\\
\item QR分解Ⅰ
\label{sec:orge40b4f0}

\begin{enumerate}
\item 定理 5.1 QR分解
\label{sec:orgd9e82b0}
　どのような行列 \(\bm{A}\ where\ \bm{A}\ \in\ \mathbb{R}^{m\times n},\ m \geq n\) についても直交行列によって上三角行列に変形することが出来る。またこの変形は以下の行列の圧縮に等しい。\\

\begin{align*}
\bm{A} = \bm{Q}
\begin{pmatrix}
\bm{R}\\
\bm{0}
\end{pmatrix}&& where\ &\bm{Q}\ \in\ \mathbb{R}^{m\times m}\ is\ orthogonal \\
             &&& \bm{R}\ \in\ \mathbb{R}^{n\times n}\ is\ upper\ triangular
\end{align*}
(orthogonal matrix=直交行列,upper triangular matrix=上三角行列)\\
　もし \(\bm{A}\) が列について線形独立であるならば \(\bm{R}\) は正則である。\\
\end{enumerate}
\end{enumerate}
\end{document}
